demo/Capillar/constant/polyMesh/blockMeshDict
FoamFile 
 { 
 version 2.0; 
 format ascii; 
 class dictionary; 
 object blockMeshDict; 
 } 
 convertToMeters 1;
vertices 
 (
( 70.710678 70.710678 0.000000 )
( 70.710678 -70.710678 0.000000 )
( -70.710678 -70.710678 0.000000 )
( -70.710678 70.710678 0.000000 )
( 10.605371 10.605372 0.000000 )
( 10.606600 -10.606601 0.000000 )
( -10.606601 -10.606600 0.000000 )
( -10.606447 10.606447 0.000000 )
( 70.710678 70.710678 -0.100000 )
( 70.710678 -70.710678 -0.100000 )
( -70.710678 -70.710678 -0.100000 )
( -70.710678 70.710678 -0.100000 )
( 10.605371 10.605372 -0.100000 )
( 10.606600 -10.606601 -0.100000 )
( -10.606601 -10.606600 -0.100000 )
( -10.606447 10.606447 -0.100000 )
);
blocks 
 (
hex ( 0 4 7 3 8 12 15 11 ) (12 132 1) simpleGrading (1 1 1)
hex ( 3 7 6 2 11 15 14 10 ) (12 132 1) simpleGrading (1 1 1)
hex ( 2 6 5 1 10 14 13 9 ) (12 132 1) simpleGrading (1 1 1)
hex ( 1 5 4 0 9 13 12 8 ) (12 132 1) simpleGrading (1 1 1)
hex ( 4 5 6 7 12 13 14 15 ) (132 132 1) simpleGrading (1 1 1)
);
edges 
 (
arc 0 3 (0 100.000000 0)
arc 8 11 (0 100.000000 -0.100000)
arc 3 2 (-100.000000 0 0)
arc 11 10 (-100.000000 0 -0.100000)
arc 2 1 (0 -100.000000 0)
arc 10 9 (0 -100.000000 -0.100000)
arc 1 0 (100.000000 0 0)
arc 9 8 (100.000000 0 -0.100000)
polyLine 5 4 (
(10.598395 -10.620511 0)
(10.609007 -10.602520 0)
(10.619600 -10.584518 0)
(10.630176 -10.566506 0)
(10.640733 -10.548483 0)
(10.651273 -10.530450 0)
(10.661794 -10.512405 0)
(10.672298 -10.494351 0)
(10.682783 -10.476286 0)
(10.693250 -10.458210 0)
(10.703699 -10.440124 0)
(10.714131 -10.422028 0)
(10.724544 -10.403921 0)
(10.734938 -10.385804 0)
(10.745315 -10.367676 0)
(10.755674 -10.349538 0)
(10.766014 -10.331390 0)
(10.776337 -10.313231 0)
(10.786641 -10.295062 0)
(10.796927 -10.276883 0)
(10.807194 -10.258693 0)
(10.817444 -10.240494 0)
(10.827675 -10.222283 0)
(10.837889 -10.204063 0)
(10.848084 -10.185833 0)
(10.858260 -10.167592 0)
(10.868419 -10.149341 0)
(10.878559 -10.131080 0)
(10.888681 -10.112809 0)
(10.898785 -10.094528 0)
(10.908870 -10.076236 0)
(10.918937 -10.057935 0)
(10.928986 -10.039624 0)
(10.939016 -10.021302 0)
(10.949028 -10.002970 0)
(10.959022 -9.984629 0)
(10.968998 -9.966277 0)
(10.978955 -9.947916 0)
(10.988893 -9.929545 0)
(10.998814 -9.911163 0)
(11.008716 -9.892772 0)
(11.018599 -9.874371 0)
(11.028465 -9.855960 0)
(11.038311 -9.837539 0)
(11.048140 -9.819108 0)
(11.057949 -9.800668 0)
(11.067741 -9.782217 0)
(11.077514 -9.763757 0)
(11.087268 -9.745287 0)
(11.097004 -9.726807 0)
(11.106722 -9.708318 0)
(11.116421 -9.689819 0)
(11.126102 -9.671310 0)
(11.135764 -9.652792 0)
(11.145407 -9.634264 0)
(11.155032 -9.615726 0)
(11.164639 -9.597179 0)
(11.174227 -9.578622 0)
(11.183796 -9.560055 0)
(11.193347 -9.541479 0)
(11.202879 -9.522893 0)
(11.212393 -9.504298 0)
(11.221888 -9.485694 0)
(11.231364 -9.467080 0)
(11.240822 -9.448456 0)
(11.250261 -9.429823 0)
(11.259681 -9.411180 0)
(11.269083 -9.392529 0)
(11.278466 -9.373867 0)
(11.287831 -9.355197 0)
(11.297177 -9.336517 0)
(11.306504 -9.317827 0)
(11.315812 -9.299129 0)
(11.325102 -9.280421 0)
(11.334373 -9.261703 0)
(11.343626 -9.242977 0)
(11.352859 -9.224241 0)
(11.362074 -9.205496 0)
(11.371270 -9.186742 0)
(11.380448 -9.167979 0)
(11.389606 -9.149206 0)
(11.398746 -9.130424 0)
(11.407867 -9.111634 0)
(11.416969 -9.092834 0)
(11.426053 -9.074025 0)
(11.435117 -9.055206 0)
(11.444163 -9.036379 0)
(11.453190 -9.017543 0)
(11.462198 -8.998698 0)
(11.471187 -8.979844 0)
(11.480158 -8.960981 0)
(11.489109 -8.942108 0)
(11.498042 -8.923227 0)
(11.506956 -8.904337 0)
(11.515851 -8.885438 0)
(11.524727 -8.866531 0)
(11.533584 -8.847614 0)
(11.542422 -8.828688 0)
(11.551241 -8.809754 0)
(11.560041 -8.790811 0)
...
)
polyLine 13 12 (
(10.598395 -10.620511 -0.100000)
(10.609007 -10.602520 -0.100000)
(10.619600 -10.584518 -0.100000)
(10.630176 -10.566506 -0.100000)
(10.640733 -10.548483 -0.100000)
(10.651273 -10.530450 -0.100000)
(10.661794 -10.512405 -0.100000)
(10.672298 -10.494351 -0.100000)
(10.682783 -10.476286 -0.100000)
(10.693250 -10.458210 -0.100000)
(10.703699 -10.440124 -0.100000)
(10.714131 -10.422028 -0.100000)
(10.724544 -10.403921 -0.100000)
(10.734938 -10.385804 -0.100000)
(10.745315 -10.367676 -0.100000)
(10.755674 -10.349538 -0.100000)
(10.766014 -10.331390 -0.100000)
(10.776337 -10.313231 -0.100000)
(10.786641 -10.295062 -0.100000)
(10.796927 -10.276883 -0.100000)
(10.807194 -10.258693 -0.100000)
(10.817444 -10.240494 -0.100000)
(10.827675 -10.222283 -0.100000)
(10.837889 -10.204063 -0.100000)
(10.848084 -10.185833 -0.100000)
(10.858260 -10.167592 -0.100000)
(10.868419 -10.149341 -0.100000)
(10.878559 -10.131080 -0.100000)
(10.888681 -10.112809 -0.100000)
(10.898785 -10.094528 -0.100000)
(10.908870 -10.076236 -0.100000)
(10.918937 -10.057935 -0.100000)
(10.928986 -10.039624 -0.100000)
(10.939016 -10.021302 -0.100000)
(10.949028 -10.002970 -0.100000)
(10.959022 -9.984629 -0.100000)
(10.968998 -9.966277 -0.100000)
(10.978955 -9.947916 -0.100000)
(10.988893 -9.929545 -0.100000)
(10.998814 -9.911163 -0.100000)
(11.008716 -9.892772 -0.100000)
(11.018599 -9.874371 -0.100000)
(11.028465 -9.855960 -0.100000)
(11.038311 -9.837539 -0.100000)
(11.048140 -9.819108 -0.100000)
(11.057949 -9.800668 -0.100000)
(11.067741 -9.782217 -0.100000)
(11.077514 -9.763757 -0.100000)
(11.087268 -9.745287 -0.100000)
(11.097004 -9.726807 -0.100000)
(11.106722 -9.708318 -0.100000)
(11.116421 -9.689819 -0.100000)
(11.126102 -9.671310 -0.100000)
(11.135764 -9.652792 -0.100000)
(11.145407 -9.634264 -0.100000)
(11.155032 -9.615726 -0.100000)
(11.164639 -9.597179 -0.100000)
(11.174227 -9.578622 -0.100000)
(11.183796 -9.560055 -0.100000)
(11.193347 -9.541479 -0.100000)
(11.202879 -9.522893 -0.100000)
(11.212393 -9.504298 -0.100000)
(11.221888 -9.485694 -0.100000)
(11.231364 -9.467080 -0.100000)
(11.240822 -9.448456 -0.100000)
(11.250261 -9.429823 -0.100000)
(11.259681 -9.411180 -0.100000)
(11.269083 -9.392529 -0.100000)
(11.278466 -9.373867 -0.100000)
(11.287831 -9.355197 -0.100000)
(11.297177 -9.336517 -0.100000)
(11.306504 -9.317827 -0.100000)
(11.315812 -9.299129 -0.100000)
(11.325102 -9.280421 -0.100000)
(11.334373 -9.261703 -0.100000)
(11.343626 -9.242977 -0.100000)
(11.352859 -9.224241 -0.100000)
(11.362074 -9.205496 -0.100000)
(11.371270 -9.186742 -0.100000)
(11.380448 -9.167979 -0.100000)
(11.389606 -9.149206 -0.100000)
(11.398746 -9.130424 -0.100000)
(11.407867 -9.111634 -0.100000)
(11.416969 -9.092834 -0.100000)
(11.426053 -9.074025 -0.100000)
(11.435117 -9.055206 -0.100000)
(11.444163 -9.036379 -0.100000)
(11.453190 -9.017543 -0.100000)
(11.462198 -8.998698 -0.100000)
(11.471187 -8.979844 -0.100000)
(11.480158 -8.960981 -0.100000)
(11.489109 -8.942108 -0.100000)
(11.498042 -8.923227 -0.100000)
(11.506956 -8.904337 -0.100000)
(11.515851 -8.885438 -0.100000)
(11.524727 -8.866531 -0.100000)
(11.533584 -8.847614 -0.100000)
(11.542422 -8.828688 -0.100000)
(11.551241 -8.809754 -0.100000)
(11.560041 -8.790811 -0.100000)
...
)
polyLine 4 7 (
(10.613227 10.595354 0)
(10.602623 10.613349 0)
(10.602520 10.609007 0)
(10.584518 10.619600 0)
(10.566506 10.630176 0)
(10.548483 10.640733 0)
(10.530450 10.651273 0)
(10.512405 10.661794 0)
(10.494351 10.672298 0)
(10.476286 10.682783 0)
(10.458210 10.693250 0)
(10.440124 10.703699 0)
(10.422028 10.714131 0)
(10.403921 10.724544 0)
(10.385804 10.734938 0)
(10.367676 10.745315 0)
(10.349538 10.755674 0)
(10.331390 10.766014 0)
(10.313231 10.776337 0)
(10.295062 10.786641 0)
(10.276883 10.796927 0)
(10.258693 10.807194 0)
(10.240494 10.817444 0)
(10.222283 10.827675 0)
(10.204063 10.837889 0)
(10.185833 10.848084 0)
(10.167592 10.858260 0)
(10.149341 10.868419 0)
(10.131080 10.878559 0)
(10.112809 10.888681 0)
(10.094528 10.898785 0)
(10.076236 10.908870 0)
(10.057935 10.918937 0)
(10.039624 10.928986 0)
(10.021302 10.939016 0)
(10.002970 10.949028 0)
(9.984629 10.959022 0)
(9.966277 10.968998 0)
(9.947916 10.978955 0)
(9.929545 10.988893 0)
(9.911163 10.998814 0)
(9.892772 11.008716 0)
(9.874371 11.018599 0)
(9.855960 11.028465 0)
(9.837539 11.038311 0)
(9.819108 11.048140 0)
(9.800668 11.057949 0)
(9.782217 11.067741 0)
(9.763757 11.077514 0)
(9.745287 11.087268 0)
(9.726807 11.097004 0)
(9.708318 11.106722 0)
(9.689819 11.116421 0)
(9.671310 11.126102 0)
(9.652792 11.135764 0)
(9.634264 11.145407 0)
(9.615726 11.155032 0)
(9.597179 11.164639 0)
(9.578622 11.174227 0)
(9.560055 11.183796 0)
(9.541479 11.193347 0)
(9.522893 11.202879 0)
(9.504298 11.212393 0)
(9.485694 11.221888 0)
(9.467080 11.231364 0)
(9.448456 11.240822 0)
(9.429823 11.250261 0)
(9.411180 11.259681 0)
(9.392529 11.269083 0)
(9.373867 11.278466 0)
(9.355197 11.287831 0)
(9.336517 11.297177 0)
(9.317827 11.306504 0)
(9.299129 11.315812 0)
(9.280421 11.325102 0)
(9.261703 11.334373 0)
(9.242977 11.343626 0)
(9.224241 11.352859 0)
(9.205496 11.362074 0)
(9.186742 11.371270 0)
(9.167979 11.380448 0)
(9.149206 11.389606 0)
(9.130424 11.398746 0)
(9.111634 11.407867 0)
(9.092834 11.416969 0)
(9.074025 11.426053 0)
(9.055206 11.435117 0)
(9.036379 11.444163 0)
(9.017543 11.453190 0)
(8.998698 11.462198 0)
(8.979844 11.471187 0)
(8.960981 11.480158 0)
(8.942108 11.489109 0)
(8.923227 11.498042 0)
(8.904337 11.506956 0)
(8.885438 11.515851 0)
(8.866531 11.524727 0)
(8.847614 11.533584 0)
(8.828688 11.542422 0)
(8.809754 11.551241 0)
...
)
polyLine 12 15 (
(10.613227 10.595354 -0.100000)
(10.602623 10.613349 -0.100000)
(10.602520 10.609007 -0.100000)
(10.584518 10.619600 -0.100000)
(10.566506 10.630176 -0.100000)
(10.548483 10.640733 -0.100000)
(10.530450 10.651273 -0.100000)
(10.512405 10.661794 -0.100000)
(10.494351 10.672298 -0.100000)
(10.476286 10.682783 -0.100000)
(10.458210 10.693250 -0.100000)
(10.440124 10.703699 -0.100000)
(10.422028 10.714131 -0.100000)
(10.403921 10.724544 -0.100000)
(10.385804 10.734938 -0.100000)
(10.367676 10.745315 -0.100000)
(10.349538 10.755674 -0.100000)
(10.331390 10.766014 -0.100000)
(10.313231 10.776337 -0.100000)
(10.295062 10.786641 -0.100000)
(10.276883 10.796927 -0.100000)
(10.258693 10.807194 -0.100000)
(10.240494 10.817444 -0.100000)
(10.222283 10.827675 -0.100000)
(10.204063 10.837889 -0.100000)
(10.185833 10.848084 -0.100000)
(10.167592 10.858260 -0.100000)
(10.149341 10.868419 -0.100000)
(10.131080 10.878559 -0.100000)
(10.112809 10.888681 -0.100000)
(10.094528 10.898785 -0.100000)
(10.076236 10.908870 -0.100000)
(10.057935 10.918937 -0.100000)
(10.039624 10.928986 -0.100000)
(10.021302 10.939016 -0.100000)
(10.002970 10.949028 -0.100000)
(9.984629 10.959022 -0.100000)
(9.966277 10.968998 -0.100000)
(9.947916 10.978955 -0.100000)
(9.929545 10.988893 -0.100000)
(9.911163 10.998814 -0.100000)
(9.892772 11.008716 -0.100000)
(9.874371 11.018599 -0.100000)
(9.855960 11.028465 -0.100000)
(9.837539 11.038311 -0.100000)
(9.819108 11.048140 -0.100000)
(9.800668 11.057949 -0.100000)
(9.782217 11.067741 -0.100000)
(9.763757 11.077514 -0.100000)
(9.745287 11.087268 -0.100000)
(9.726807 11.097004 -0.100000)
(9.708318 11.106722 -0.100000)
(9.689819 11.116421 -0.100000)
(9.671310 11.126102 -0.100000)
(9.652792 11.135764 -0.100000)
(9.634264 11.145407 -0.100000)
(9.615726 11.155032 -0.100000)
(9.597179 11.164639 -0.100000)
(9.578622 11.174227 -0.100000)
(9.560055 11.183796 -0.100000)
(9.541479 11.193347 -0.100000)
(9.522893 11.202879 -0.100000)
(9.504298 11.212393 -0.100000)
(9.485694 11.221888 -0.100000)
(9.467080 11.231364 -0.100000)
(9.448456 11.240822 -0.100000)
(9.429823 11.250261 -0.100000)
(9.411180 11.259681 -0.100000)
(9.392529 11.269083 -0.100000)
(9.373867 11.278466 -0.100000)
(9.355197 11.287831 -0.100000)
(9.336517 11.297177 -0.100000)
(9.317827 11.306504 -0.100000)
(9.299129 11.315812 -0.100000)
(9.280421 11.325102 -0.100000)
(9.261703 11.334373 -0.100000)
(9.242977 11.343626 -0.100000)
(9.224241 11.352859 -0.100000)
(9.205496 11.362074 -0.100000)
(9.186742 11.371270 -0.100000)
(9.167979 11.380448 -0.100000)
(9.149206 11.389606 -0.100000)
(9.130424 11.398746 -0.100000)
(9.111634 11.407867 -0.100000)
(9.092834 11.416969 -0.100000)
(9.074025 11.426053 -0.100000)
(9.055206 11.435117 -0.100000)
(9.036379 11.444163 -0.100000)
(9.017543 11.453190 -0.100000)
(8.998698 11.462198 -0.100000)
(8.979844 11.471187 -0.100000)
(8.960981 11.480158 -0.100000)
(8.942108 11.489109 -0.100000)
(8.923227 11.498042 -0.100000)
(8.904337 11.506956 -0.100000)
(8.885438 11.515851 -0.100000)
(8.866531 11.524727 -0.100000)
(8.847614 11.533584 -0.100000)
(8.828688 11.542422 -0.100000)
(8.809754 11.551241 -0.100000)
...
)
polyLine 6 5 (
(-10.602520 -10.609007 0)
(-10.584518 -10.619600 0)
(-10.566506 -10.630176 0)
(-10.548483 -10.640733 0)
(-10.530450 -10.651273 0)
(-10.512405 -10.661794 0)
(-10.494351 -10.672298 0)
(-10.476286 -10.682783 0)
(-10.458210 -10.693250 0)
(-10.440124 -10.703699 0)
(-10.422028 -10.714131 0)
(-10.403921 -10.724544 0)
(-10.385804 -10.734938 0)
(-10.367676 -10.745315 0)
(-10.349538 -10.755674 0)
(-10.331390 -10.766014 0)
(-10.313231 -10.776337 0)
(-10.295062 -10.786641 0)
(-10.276883 -10.796927 0)
(-10.258693 -10.807194 0)
(-10.240494 -10.817444 0)
(-10.222283 -10.827675 0)
(-10.204063 -10.837889 0)
(-10.185833 -10.848084 0)
(-10.167592 -10.858260 0)
(-10.149341 -10.868419 0)
(-10.131080 -10.878559 0)
(-10.112809 -10.888681 0)
(-10.094528 -10.898785 0)
(-10.076236 -10.908870 0)
(-10.057935 -10.918937 0)
(-10.039624 -10.928986 0)
(-10.021302 -10.939016 0)
(-10.002970 -10.949028 0)
(-9.984629 -10.959022 0)
(-9.966277 -10.968998 0)
(-9.947916 -10.978955 0)
(-9.929545 -10.988893 0)
(-9.911163 -10.998814 0)
(-9.892772 -11.008716 0)
(-9.874371 -11.018599 0)
(-9.855960 -11.028465 0)
(-9.837539 -11.038311 0)
(-9.819108 -11.048140 0)
(-9.800668 -11.057949 0)
(-9.782217 -11.067741 0)
(-9.763757 -11.077514 0)
(-9.745287 -11.087268 0)
(-9.726807 -11.097004 0)
(-9.708318 -11.106722 0)
(-9.689819 -11.116421 0)
(-9.671310 -11.126102 0)
(-9.652792 -11.135764 0)
(-9.634264 -11.145407 0)
(-9.615726 -11.155032 0)
(-9.597179 -11.164639 0)
(-9.578622 -11.174227 0)
(-9.560055 -11.183796 0)
(-9.541479 -11.193347 0)
(-9.522893 -11.202879 0)
(-9.504298 -11.212393 0)
(-9.485694 -11.221888 0)
(-9.467080 -11.231364 0)
(-9.448456 -11.240822 0)
(-9.429823 -11.250261 0)
(-9.411180 -11.259681 0)
(-9.392529 -11.269083 0)
(-9.373867 -11.278466 0)
(-9.355197 -11.287831 0)
(-9.336517 -11.297177 0)
(-9.317827 -11.306504 0)
(-9.299129 -11.315812 0)
(-9.280421 -11.325102 0)
(-9.261703 -11.334373 0)
(-9.242977 -11.343626 0)
(-9.224241 -11.352859 0)
(-9.205496 -11.362074 0)
(-9.186742 -11.371270 0)
(-9.167979 -11.380448 0)
(-9.149206 -11.389606 0)
(-9.130424 -11.398746 0)
(-9.111634 -11.407867 0)
(-9.092834 -11.416969 0)
(-9.074025 -11.426053 0)
(-9.055206 -11.435117 0)
(-9.036379 -11.444163 0)
(-9.017543 -11.453190 0)
(-8.998698 -11.462198 0)
(-8.979844 -11.471187 0)
(-8.960981 -11.480158 0)
(-8.942108 -11.489109 0)
(-8.923227 -11.498042 0)
(-8.904337 -11.506956 0)
(-8.885438 -11.515851 0)
(-8.866531 -11.524727 0)
(-8.847614 -11.533584 0)
(-8.828688 -11.542422 0)
(-8.809754 -11.551241 0)
(-8.790811 -11.560041 0)
(-8.771859 -11.568823 0)
...
)
polyLine 14 13 (
(-10.602520 -10.609007 -0.100000)
(-10.584518 -10.619600 -0.100000)
(-10.566506 -10.630176 -0.100000)
(-10.548483 -10.640733 -0.100000)
(-10.530450 -10.651273 -0.100000)
(-10.512405 -10.661794 -0.100000)
(-10.494351 -10.672298 -0.100000)
(-10.476286 -10.682783 -0.100000)
(-10.458210 -10.693250 -0.100000)
(-10.440124 -10.703699 -0.100000)
(-10.422028 -10.714131 -0.100000)
(-10.403921 -10.724544 -0.100000)
(-10.385804 -10.734938 -0.100000)
(-10.367676 -10.745315 -0.100000)
(-10.349538 -10.755674 -0.100000)
(-10.331390 -10.766014 -0.100000)
(-10.313231 -10.776337 -0.100000)
(-10.295062 -10.786641 -0.100000)
(-10.276883 -10.796927 -0.100000)
(-10.258693 -10.807194 -0.100000)
(-10.240494 -10.817444 -0.100000)
(-10.222283 -10.827675 -0.100000)
(-10.204063 -10.837889 -0.100000)
(-10.185833 -10.848084 -0.100000)
(-10.167592 -10.858260 -0.100000)
(-10.149341 -10.868419 -0.100000)
(-10.131080 -10.878559 -0.100000)
(-10.112809 -10.888681 -0.100000)
(-10.094528 -10.898785 -0.100000)
(-10.076236 -10.908870 -0.100000)
(-10.057935 -10.918937 -0.100000)
(-10.039624 -10.928986 -0.100000)
(-10.021302 -10.939016 -0.100000)
(-10.002970 -10.949028 -0.100000)
(-9.984629 -10.959022 -0.100000)
(-9.966277 -10.968998 -0.100000)
(-9.947916 -10.978955 -0.100000)
(-9.929545 -10.988893 -0.100000)
(-9.911163 -10.998814 -0.100000)
(-9.892772 -11.008716 -0.100000)
(-9.874371 -11.018599 -0.100000)
(-9.855960 -11.028465 -0.100000)
(-9.837539 -11.038311 -0.100000)
(-9.819108 -11.048140 -0.100000)
(-9.800668 -11.057949 -0.100000)
(-9.782217 -11.067741 -0.100000)
(-9.763757 -11.077514 -0.100000)
(-9.745287 -11.087268 -0.100000)
(-9.726807 -11.097004 -0.100000)
(-9.708318 -11.106722 -0.100000)
(-9.689819 -11.116421 -0.100000)
(-9.671310 -11.126102 -0.100000)
(-9.652792 -11.135764 -0.100000)
(-9.634264 -11.145407 -0.100000)
(-9.615726 -11.155032 -0.100000)
(-9.597179 -11.164639 -0.100000)
(-9.578622 -11.174227 -0.100000)
(-9.560055 -11.183796 -0.100000)
(-9.541479 -11.193347 -0.100000)
(-9.522893 -11.202879 -0.100000)
(-9.504298 -11.212393 -0.100000)
(-9.485694 -11.221888 -0.100000)
(-9.467080 -11.231364 -0.100000)
(-9.448456 -11.240822 -0.100000)
(-9.429823 -11.250261 -0.100000)
(-9.411180 -11.259681 -0.100000)
(-9.392529 -11.269083 -0.100000)
(-9.373867 -11.278466 -0.100000)
(-9.355197 -11.287831 -0.100000)
(-9.336517 -11.297177 -0.100000)
(-9.317827 -11.306504 -0.100000)
(-9.299129 -11.315812 -0.100000)
(-9.280421 -11.325102 -0.100000)
(-9.261703 -11.334373 -0.100000)
(-9.242977 -11.343626 -0.100000)
(-9.224241 -11.352859 -0.100000)
(-9.205496 -11.362074 -0.100000)
(-9.186742 -11.371270 -0.100000)
(-9.167979 -11.380448 -0.100000)
(-9.149206 -11.389606 -0.100000)
(-9.130424 -11.398746 -0.100000)
(-9.111634 -11.407867 -0.100000)
(-9.092834 -11.416969 -0.100000)
(-9.074025 -11.426053 -0.100000)
(-9.055206 -11.435117 -0.100000)
(-9.036379 -11.444163 -0.100000)
(-9.017543 -11.453190 -0.100000)
(-8.998698 -11.462198 -0.100000)
(-8.979844 -11.471187 -0.100000)
(-8.960981 -11.480158 -0.100000)
(-8.942108 -11.489109 -0.100000)
(-8.923227 -11.498042 -0.100000)
(-8.904337 -11.506956 -0.100000)
(-8.885438 -11.515851 -0.100000)
(-8.866531 -11.524727 -0.100000)
(-8.847614 -11.533584 -0.100000)
(-8.828688 -11.542422 -0.100000)
(-8.809754 -11.551241 -0.100000)
(-8.790811 -11.560041 -0.100000)
(-8.771859 -11.568823 -0.100000)
...
)
polyLine 7 6 (
(-10.619600 10.584518 0)
(-10.630176 10.566506 0)
(-10.640733 10.548483 0)
(-10.651273 10.530450 0)
(-10.661794 10.512405 0)
(-10.672298 10.494351 0)
(-10.682783 10.476286 0)
(-10.693250 10.458210 0)
(-10.703699 10.440124 0)
(-10.714131 10.422028 0)
(-10.724544 10.403921 0)
(-10.734938 10.385804 0)
(-10.745315 10.367676 0)
(-10.755674 10.349538 0)
(-10.766014 10.331390 0)
(-10.776337 10.313231 0)
(-10.786641 10.295062 0)
(-10.796927 10.276883 0)
(-10.807194 10.258693 0)
(-10.817444 10.240494 0)
(-10.827675 10.222283 0)
(-10.837889 10.204063 0)
(-10.848084 10.185833 0)
(-10.858260 10.167592 0)
(-10.868419 10.149341 0)
(-10.878559 10.131080 0)
(-10.888681 10.112809 0)
(-10.898785 10.094528 0)
(-10.908870 10.076236 0)
(-10.918937 10.057935 0)
(-10.928986 10.039624 0)
(-10.939016 10.021302 0)
(-10.949028 10.002970 0)
(-10.959022 9.984629 0)
(-10.968998 9.966277 0)
(-10.978955 9.947916 0)
(-10.988893 9.929545 0)
(-10.998814 9.911163 0)
(-11.008716 9.892772 0)
(-11.018599 9.874371 0)
(-11.028465 9.855960 0)
(-11.038311 9.837539 0)
(-11.048140 9.819108 0)
(-11.057949 9.800668 0)
(-11.067741 9.782217 0)
(-11.077514 9.763757 0)
(-11.087268 9.745287 0)
(-11.097004 9.726807 0)
(-11.106722 9.708318 0)
(-11.116421 9.689819 0)
(-11.126102 9.671310 0)
(-11.135764 9.652792 0)
(-11.145407 9.634264 0)
(-11.155032 9.615726 0)
(-11.164639 9.597179 0)
(-11.174227 9.578622 0)
(-11.183796 9.560055 0)
(-11.193347 9.541479 0)
(-11.202879 9.522893 0)
(-11.212393 9.504298 0)
(-11.221888 9.485694 0)
(-11.231364 9.467080 0)
(-11.240822 9.448456 0)
(-11.250261 9.429823 0)
(-11.259681 9.411180 0)
(-11.269083 9.392529 0)
(-11.278466 9.373867 0)
(-11.287831 9.355197 0)
(-11.297177 9.336517 0)
(-11.306504 9.317827 0)
(-11.315812 9.299129 0)
(-11.325102 9.280421 0)
(-11.334373 9.261703 0)
(-11.343626 9.242977 0)
(-11.352859 9.224241 0)
(-11.362074 9.205496 0)
(-11.371270 9.186742 0)
(-11.380448 9.167979 0)
(-11.389606 9.149206 0)
(-11.398746 9.130424 0)
(-11.407867 9.111634 0)
(-11.416969 9.092834 0)
(-11.426053 9.074025 0)
(-11.435117 9.055206 0)
(-11.444163 9.036379 0)
(-11.453190 9.017543 0)
(-11.462198 8.998698 0)
(-11.471187 8.979844 0)
(-11.480158 8.960981 0)
(-11.489109 8.942108 0)
(-11.498042 8.923227 0)
(-11.506956 8.904337 0)
(-11.515851 8.885438 0)
(-11.524727 8.866531 0)
(-11.533584 8.847614 0)
(-11.542422 8.828688 0)
(-11.551241 8.809754 0)
(-11.560041 8.790811 0)
(-11.568823 8.771859 0)
(-11.577585 8.752898 0)
...
)
polyLine 15 14 (
(-10.619600 10.584518 -0.100000)
(-10.630176 10.566506 -0.100000)
(-10.640733 10.548483 -0.100000)
(-10.651273 10.530450 -0.100000)
(-10.661794 10.512405 -0.100000)
(-10.672298 10.494351 -0.100000)
(-10.682783 10.476286 -0.100000)
(-10.693250 10.458210 -0.100000)
(-10.703699 10.440124 -0.100000)
(-10.714131 10.422028 -0.100000)
(-10.724544 10.403921 -0.100000)
(-10.734938 10.385804 -0.100000)
(-10.745315 10.367676 -0.100000)
(-10.755674 10.349538 -0.100000)
(-10.766014 10.331390 -0.100000)
(-10.776337 10.313231 -0.100000)
(-10.786641 10.295062 -0.100000)
(-10.796927 10.276883 -0.100000)
(-10.807194 10.258693 -0.100000)
(-10.817444 10.240494 -0.100000)
(-10.827675 10.222283 -0.100000)
(-10.837889 10.204063 -0.100000)
(-10.848084 10.185833 -0.100000)
(-10.858260 10.167592 -0.100000)
(-10.868419 10.149341 -0.100000)
(-10.878559 10.131080 -0.100000)
(-10.888681 10.112809 -0.100000)
(-10.898785 10.094528 -0.100000)
(-10.908870 10.076236 -0.100000)
(-10.918937 10.057935 -0.100000)
(-10.928986 10.039624 -0.100000)
(-10.939016 10.021302 -0.100000)
(-10.949028 10.002970 -0.100000)
(-10.959022 9.984629 -0.100000)
(-10.968998 9.966277 -0.100000)
(-10.978955 9.947916 -0.100000)
(-10.988893 9.929545 -0.100000)
(-10.998814 9.911163 -0.100000)
(-11.008716 9.892772 -0.100000)
(-11.018599 9.874371 -0.100000)
(-11.028465 9.855960 -0.100000)
(-11.038311 9.837539 -0.100000)
(-11.048140 9.819108 -0.100000)
(-11.057949 9.800668 -0.100000)
(-11.067741 9.782217 -0.100000)
(-11.077514 9.763757 -0.100000)
(-11.087268 9.745287 -0.100000)
(-11.097004 9.726807 -0.100000)
(-11.106722 9.708318 -0.100000)
(-11.116421 9.689819 -0.100000)
(-11.126102 9.671310 -0.100000)
(-11.135764 9.652792 -0.100000)
(-11.145407 9.634264 -0.100000)
(-11.155032 9.615726 -0.100000)
(-11.164639 9.597179 -0.100000)
(-11.174227 9.578622 -0.100000)
(-11.183796 9.560055 -0.100000)
(-11.193347 9.541479 -0.100000)
(-11.202879 9.522893 -0.100000)
(-11.212393 9.504298 -0.100000)
(-11.221888 9.485694 -0.100000)
(-11.231364 9.467080 -0.100000)
(-11.240822 9.448456 -0.100000)
(-11.250261 9.429823 -0.100000)
(-11.259681 9.411180 -0.100000)
(-11.269083 9.392529 -0.100000)
(-11.278466 9.373867 -0.100000)
(-11.287831 9.355197 -0.100000)
(-11.297177 9.336517 -0.100000)
(-11.306504 9.317827 -0.100000)
(-11.315812 9.299129 -0.100000)
(-11.325102 9.280421 -0.100000)
(-11.334373 9.261703 -0.100000)
(-11.343626 9.242977 -0.100000)
(-11.352859 9.224241 -0.100000)
(-11.362074 9.205496 -0.100000)
(-11.371270 9.186742 -0.100000)
(-11.380448 9.167979 -0.100000)
(-11.389606 9.149206 -0.100000)
(-11.398746 9.130424 -0.100000)
(-11.407867 9.111634 -0.100000)
(-11.416969 9.092834 -0.100000)
(-11.426053 9.074025 -0.100000)
(-11.435117 9.055206 -0.100000)
(-11.444163 9.036379 -0.100000)
(-11.453190 9.017543 -0.100000)
(-11.462198 8.998698 -0.100000)
(-11.471187 8.979844 -0.100000)
(-11.480158 8.960981 -0.100000)
(-11.489109 8.942108 -0.100000)
(-11.498042 8.923227 -0.100000)
(-11.506956 8.904337 -0.100000)
(-11.515851 8.885438 -0.100000)
(-11.524727 8.866531 -0.100000)
(-11.533584 8.847614 -0.100000)
(-11.542422 8.828688 -0.100000)
(-11.551241 8.809754 -0.100000)
(-11.560041 8.790811 -0.100000)
(-11.568823 8.771859 -0.100000)
(-11.577585 8.752898 -0.100000)
...
);
patches 
 (
patch inletOutlet
(
(3 0 8 11)
(0 1 9 8)
(1 2 10 9)
(2 3 11 10)
)
patch outlet
(
(2 6 7 3)
(3 7 4 0)
(0 4 5 1)
(1 5 6 2)
(4 5 6 7)
)
patch inlet
(
(11 15 14 10)
(8 12 15 11)
(9 13 12 8)
(10 14 13 9)
(15 14 13 12)
));
mergePatchpairs ();
