demo/Capillar/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inletOutlet
    {
        type            patch;
        nFaces          5808;
        startFace       757416;
    }
    outlet
    {
        type            patch;
        nFaces          23760;
        startFace       763224;
    }
    inlet
    {
        type            patch;
        nFaces          23760;
        startFace       786984;
    }
)

// ************************************************************************* //
