demo/Capillar/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      extrudeMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
extrudeModel linearDirection;
nLayers	     10;
expansionRatio 1;
linearDirectionCoeffs	{
	direction	(0 0 1);
	thickness	1000;
}
flipNormals false;
constructFrom mesh;
sourcePatches (outlet);
sourceCase  ".";

mergeFaces false;
//exposedPatchName	inlet;
// ************************************************************************* //
